{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "MovinetClassifier", "config": {"backbone": {"class_name": "Vision>Movinet", "config": {"model_id": "a0", "causal": false, "use_positional_encoding": false, "conv_type": "3d", "activation": "swish", "use_sync_bn": true, "norm_momentum": 0.99, "norm_epsilon": 0.001, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "bias_regularizer": null, "stochastic_depth_drop_rate": 0.0, "use_external_states": false, "output_states": true}, "__passive_serialization__": true}, "activation": "swish", "num_classes": 6, "input_specs": {"image": {"class_name": "InputSpec", "config": {"dtype": null, "shape": [null, null, null, null, 3], "ndim": 5, "max_ndim": null, "min_ndim": null, "axes": {}}, "__passive_serialization__": true}}, "dropout_rate": 0.0, "kernel_initializer": "HeNormal", "kernel_regularizer": null, "bias_regularizer": null, "output_states": false}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true, "ignore_class": null}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "classifier_head_3/head/conv3d/kernel", "shape": [1, 1, 1, 480, 2048], "dtype": "float32"}, {"name": "classifier_head_3/head/conv3d/bias", "shape": [2048], "dtype": "float32"}, {"name": "classifier_head_3/classifier/conv3d/kernel", "shape": [1, 1, 1, 2048, 6], "dtype": "float32"}, {"name": "classifier_head_3/classifier/conv3d/bias", "shape": [6], "dtype": "float32"}, {"name": "stem/stem/bn/gamma", "shape": [8], "dtype": "float32"}, {"name": "stem/stem/bn/beta", "shape": [8], "dtype": "float32"}, {"name": "stem/stem/bn/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "stem/stem/bn/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "stem/stem/conv3d/kernel", "shape": [1, 3, 3, 3, 8], "dtype": "float32"}, {"name": "block0_layer0/bneck/expansion/bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/expansion/bn/beta", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/expansion/bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/expansion/bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 8, 24], "dtype": "float32"}, {"name": "block0_layer0/bneck/feature/bn/gamma", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/feature/bn/beta", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/feature/bn/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/feature/bn/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/feature/conv3d/kernel", "shape": [1, 5, 5, 1, 24], "dtype": "float32"}, {"name": "block0_layer0/bneck/projection/bn/gamma", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/projection/bn/beta", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/projection/bn/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/projection/bn/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 24, 8], "dtype": "float32"}, {"name": "block0_layer0/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 24, 8], "dtype": "float32"}, {"name": "block0_layer0/bneck/se/se_reduce/conv3d/bias", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 8, 24], "dtype": "float32"}, {"name": "block0_layer0/bneck/se/se_expand/conv3d/bias", "shape": [24], "dtype": "float32"}, {"name": "block0_layer0/bneck/skip/skip_project/bn/gamma", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/skip/skip_project/bn/beta", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/skip/skip_project/bn/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/skip/skip_project/bn/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "block0_layer0/bneck/skip/skip_project/conv3d/kernel", "shape": [1, 1, 1, 8, 8], "dtype": "float32"}, {"name": "block0_layer0/scale", "shape": [], "dtype": "float32"}, {"name": "block1_layer0/bneck/expansion/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/expansion/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/expansion/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/expansion/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 8, 80], "dtype": "float32"}, {"name": "block1_layer0/bneck/feature/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/feature/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/feature/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/feature/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 80], "dtype": "float32"}, {"name": "block1_layer0/bneck/projection/bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/projection/bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/projection/bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/projection/bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 80, 32], "dtype": "float32"}, {"name": "block1_layer0/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 80, 24], "dtype": "float32"}, {"name": "block1_layer0/bneck/se/se_reduce/conv3d/bias", "shape": [24], "dtype": "float32"}, {"name": "block1_layer0/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 24, 80], "dtype": "float32"}, {"name": "block1_layer0/bneck/se/se_expand/conv3d/bias", "shape": [80], "dtype": "float32"}, {"name": "block1_layer0/bneck/skip/skip_project/bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/skip/skip_project/bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/skip/skip_project/bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/skip/skip_project/bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1_layer0/bneck/skip/skip_project/conv3d/kernel", "shape": [1, 1, 1, 8, 32], "dtype": "float32"}, {"name": "block1_layer0/scale", "shape": [], "dtype": "float32"}, {"name": "block1_layer1/bneck/expansion/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/expansion/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/expansion/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/expansion/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 32, 80], "dtype": "float32"}, {"name": "block1_layer1/bneck/feature/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/feature/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/feature/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/feature/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 80], "dtype": "float32"}, {"name": "block1_layer1/bneck/projection/bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_layer1/bneck/projection/bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_layer1/bneck/projection/bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_layer1/bneck/projection/bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1_layer1/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 80, 32], "dtype": "float32"}, {"name": "block1_layer1/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 80, 24], "dtype": "float32"}, {"name": "block1_layer1/bneck/se/se_reduce/conv3d/bias", "shape": [24], "dtype": "float32"}, {"name": "block1_layer1/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 24, 80], "dtype": "float32"}, {"name": "block1_layer1/bneck/se/se_expand/conv3d/bias", "shape": [80], "dtype": "float32"}, {"name": "block1_layer1/scale", "shape": [], "dtype": "float32"}, {"name": "block1_layer2/bneck/expansion/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/expansion/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/expansion/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/expansion/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 32, 80], "dtype": "float32"}, {"name": "block1_layer2/bneck/feature/bn/gamma", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/feature/bn/beta", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/feature/bn/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/feature/bn/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 80], "dtype": "float32"}, {"name": "block1_layer2/bneck/projection/bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block1_layer2/bneck/projection/bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1_layer2/bneck/projection/bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block1_layer2/bneck/projection/bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1_layer2/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 80, 32], "dtype": "float32"}, {"name": "block1_layer2/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 80, 24], "dtype": "float32"}, {"name": "block1_layer2/bneck/se/se_reduce/conv3d/bias", "shape": [24], "dtype": "float32"}, {"name": "block1_layer2/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 24, 80], "dtype": "float32"}, {"name": "block1_layer2/bneck/se/se_expand/conv3d/bias", "shape": [80], "dtype": "float32"}, {"name": "block1_layer2/scale", "shape": [], "dtype": "float32"}, {"name": "block2_layer0/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 32, 184], "dtype": "float32"}, {"name": "block2_layer0/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/feature/conv3d/kernel", "shape": [5, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block2_layer0/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block2_layer0/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block2_layer0/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block2_layer0/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block2_layer0/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block2_layer0/bneck/skip/skip_project/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/skip/skip_project/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/skip/skip_project/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/skip/skip_project/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block2_layer0/bneck/skip/skip_project/conv3d/kernel", "shape": [1, 1, 1, 32, 56], "dtype": "float32"}, {"name": "block2_layer0/scale", "shape": [], "dtype": "float32"}, {"name": "block2_layer1/bneck/expansion/bn/gamma", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/expansion/bn/beta", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/expansion/bn/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/expansion/bn/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 112], "dtype": "float32"}, {"name": "block2_layer1/bneck/feature/bn/gamma", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/feature/bn/beta", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/feature/bn/moving_mean", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/feature/bn/moving_variance", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 112], "dtype": "float32"}, {"name": "block2_layer1/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block2_layer1/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block2_layer1/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block2_layer1/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block2_layer1/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 112, 56], "dtype": "float32"}, {"name": "block2_layer1/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 112, 32], "dtype": "float32"}, {"name": "block2_layer1/bneck/se/se_reduce/conv3d/bias", "shape": [32], "dtype": "float32"}, {"name": "block2_layer1/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 32, 112], "dtype": "float32"}, {"name": "block2_layer1/bneck/se/se_expand/conv3d/bias", "shape": [112], "dtype": "float32"}, {"name": "block2_layer1/scale", "shape": [], "dtype": "float32"}, {"name": "block2_layer2/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 184], "dtype": "float32"}, {"name": "block2_layer2/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block2_layer2/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block2_layer2/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block2_layer2/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block2_layer2/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block2_layer2/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block2_layer2/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block2_layer2/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block2_layer2/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block2_layer2/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block2_layer2/scale", "shape": [], "dtype": "float32"}, {"name": "block3_layer0/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 184], "dtype": "float32"}, {"name": "block3_layer0/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/bneck/feature/conv3d/kernel", "shape": [5, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block3_layer0/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3_layer0/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3_layer0/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3_layer0/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3_layer0/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block3_layer0/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block3_layer0/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block3_layer0/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block3_layer0/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block3_layer0/scale", "shape": [], "dtype": "float32"}, {"name": "block3_layer1/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 184], "dtype": "float32"}, {"name": "block3_layer1/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block3_layer1/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3_layer1/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3_layer1/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3_layer1/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3_layer1/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block3_layer1/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block3_layer1/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block3_layer1/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block3_layer1/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block3_layer1/scale", "shape": [], "dtype": "float32"}, {"name": "block3_layer2/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 184], "dtype": "float32"}, {"name": "block3_layer2/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block3_layer2/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3_layer2/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3_layer2/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3_layer2/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3_layer2/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block3_layer2/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block3_layer2/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block3_layer2/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block3_layer2/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block3_layer2/scale", "shape": [], "dtype": "float32"}, {"name": "block3_layer3/bneck/expansion/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/expansion/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/expansion/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/expansion/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 184], "dtype": "float32"}, {"name": "block3_layer3/bneck/feature/bn/gamma", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/feature/bn/beta", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/feature/bn/moving_mean", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/feature/bn/moving_variance", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/bneck/feature/conv3d/kernel", "shape": [3, 3, 3, 1, 184], "dtype": "float32"}, {"name": "block3_layer3/bneck/projection/bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3_layer3/bneck/projection/bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3_layer3/bneck/projection/bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3_layer3/bneck/projection/bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3_layer3/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 184, 56], "dtype": "float32"}, {"name": "block3_layer3/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 184, 48], "dtype": "float32"}, {"name": "block3_layer3/bneck/se/se_reduce/conv3d/bias", "shape": [48], "dtype": "float32"}, {"name": "block3_layer3/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 48, 184], "dtype": "float32"}, {"name": "block3_layer3/bneck/se/se_expand/conv3d/bias", "shape": [184], "dtype": "float32"}, {"name": "block3_layer3/scale", "shape": [], "dtype": "float32"}, {"name": "block4_layer0/bneck/expansion/bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/expansion/bn/beta", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/expansion/bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/expansion/bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 56, 384], "dtype": "float32"}, {"name": "block4_layer0/bneck/feature/bn/gamma", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/feature/bn/beta", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/feature/bn/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/feature/bn/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/feature/conv3d/kernel", "shape": [5, 3, 3, 1, 384], "dtype": "float32"}, {"name": "block4_layer0/bneck/projection/bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/projection/bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/projection/bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/projection/bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 384, 104], "dtype": "float32"}, {"name": "block4_layer0/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 384, 96], "dtype": "float32"}, {"name": "block4_layer0/bneck/se/se_reduce/conv3d/bias", "shape": [96], "dtype": "float32"}, {"name": "block4_layer0/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 96, 384], "dtype": "float32"}, {"name": "block4_layer0/bneck/se/se_expand/conv3d/bias", "shape": [384], "dtype": "float32"}, {"name": "block4_layer0/bneck/skip/skip_project/bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/skip/skip_project/bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/skip/skip_project/bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/skip/skip_project/bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4_layer0/bneck/skip/skip_project/conv3d/kernel", "shape": [1, 1, 1, 56, 104], "dtype": "float32"}, {"name": "block4_layer0/scale", "shape": [], "dtype": "float32"}, {"name": "block4_layer1/bneck/expansion/bn/gamma", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/expansion/bn/beta", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/expansion/bn/moving_mean", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/expansion/bn/moving_variance", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 104, 280], "dtype": "float32"}, {"name": "block4_layer1/bneck/feature/bn/gamma", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/feature/bn/beta", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/feature/bn/moving_mean", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/feature/bn/moving_variance", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/bneck/feature/conv3d/kernel", "shape": [1, 5, 5, 1, 280], "dtype": "float32"}, {"name": "block4_layer1/bneck/projection/bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4_layer1/bneck/projection/bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4_layer1/bneck/projection/bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4_layer1/bneck/projection/bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4_layer1/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 280, 104], "dtype": "float32"}, {"name": "block4_layer1/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 280, 72], "dtype": "float32"}, {"name": "block4_layer1/bneck/se/se_reduce/conv3d/bias", "shape": [72], "dtype": "float32"}, {"name": "block4_layer1/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 72, 280], "dtype": "float32"}, {"name": "block4_layer1/bneck/se/se_expand/conv3d/bias", "shape": [280], "dtype": "float32"}, {"name": "block4_layer1/scale", "shape": [], "dtype": "float32"}, {"name": "block4_layer2/bneck/expansion/bn/gamma", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/expansion/bn/beta", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/expansion/bn/moving_mean", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/expansion/bn/moving_variance", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 104, 280], "dtype": "float32"}, {"name": "block4_layer2/bneck/feature/bn/gamma", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/feature/bn/beta", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/feature/bn/moving_mean", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/feature/bn/moving_variance", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/bneck/feature/conv3d/kernel", "shape": [1, 5, 5, 1, 280], "dtype": "float32"}, {"name": "block4_layer2/bneck/projection/bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4_layer2/bneck/projection/bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4_layer2/bneck/projection/bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4_layer2/bneck/projection/bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4_layer2/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 280, 104], "dtype": "float32"}, {"name": "block4_layer2/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 280, 72], "dtype": "float32"}, {"name": "block4_layer2/bneck/se/se_reduce/conv3d/bias", "shape": [72], "dtype": "float32"}, {"name": "block4_layer2/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 72, 280], "dtype": "float32"}, {"name": "block4_layer2/bneck/se/se_expand/conv3d/bias", "shape": [280], "dtype": "float32"}, {"name": "block4_layer2/scale", "shape": [], "dtype": "float32"}, {"name": "block4_layer3/bneck/expansion/bn/gamma", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/expansion/bn/beta", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/expansion/bn/moving_mean", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/expansion/bn/moving_variance", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/expansion/conv3d/kernel", "shape": [1, 1, 1, 104, 344], "dtype": "float32"}, {"name": "block4_layer3/bneck/feature/bn/gamma", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/feature/bn/beta", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/feature/bn/moving_mean", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/feature/bn/moving_variance", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/bneck/feature/conv3d/kernel", "shape": [1, 5, 5, 1, 344], "dtype": "float32"}, {"name": "block4_layer3/bneck/projection/bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4_layer3/bneck/projection/bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4_layer3/bneck/projection/bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4_layer3/bneck/projection/bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4_layer3/bneck/projection/conv3d/kernel", "shape": [1, 1, 1, 344, 104], "dtype": "float32"}, {"name": "block4_layer3/bneck/se/se_reduce/conv3d/kernel", "shape": [1, 1, 1, 344, 88], "dtype": "float32"}, {"name": "block4_layer3/bneck/se/se_reduce/conv3d/bias", "shape": [88], "dtype": "float32"}, {"name": "block4_layer3/bneck/se/se_expand/conv3d/kernel", "shape": [1, 1, 1, 88, 344], "dtype": "float32"}, {"name": "block4_layer3/bneck/se/se_expand/conv3d/bias", "shape": [344], "dtype": "float32"}, {"name": "block4_layer3/scale", "shape": [], "dtype": "float32"}, {"name": "head/project/bn/gamma", "shape": [480], "dtype": "float32"}, {"name": "head/project/bn/beta", "shape": [480], "dtype": "float32"}, {"name": "head/project/bn/moving_mean", "shape": [480], "dtype": "float32"}, {"name": "head/project/bn/moving_variance", "shape": [480], "dtype": "float32"}, {"name": "head/project/conv3d/kernel", "shape": [1, 1, 1, 104, 480], "dtype": "float32"}]}]}